START_FOR_NEWBIES = '''<b>Приветствую тебя, {name}!</b>

Рекомендую тебе начать с подсказки - нажми\n<b>"Как со мной общаться?"</b>
Или сразу создавай свой список желаний с помощью кнопки <b>"Создать мой список желаний"</b>
Или ищи список желаний друга с помощью кнопки <b>"Выбрать подарок другу"</b>
'''


START = '''<b>Приветствую тебя, {name}!</b>

Сколько желаний у тебя есть?
'''


INSTRUCTION = '''
<b>Как создать свой список желаний и поделиться им с друзьями? ✏️</b>
🔰 Выбери "Создать мой список желаний" и расскажи мне немного о себе ИЛИ выбери "Открыть мой список подарков", если мы уже познакомились.
🔰 Теперь ты можешь добавить желания в свой список. Пользуйся кнопками "Добавить желание" или "Добавить желания списком". 
<b>Расскажи подробно, что ты хочешь, чтобы твои друзья точно тебя поняли.</b>
🔰 Твои желания появятся в списке. Под каждым будут кнопки "Удалить" и "Добавить ссылку" (можно прикрепить ссылку на товар в интернете или на его изображение).
🔰 Под списком желаний будет указан твой уникальный 6-ти значный код, которым нужно поделиться с друзьями, чтобы они увидели твой список желаний.
<b>Если при регистрации ты сообщил мне свой номер телефона, то друзья могут найти твой список по этому номеру телефона.</b>

<b>Как найти список желаний друга? 🔎</b>
🔰 Выбери "Выбрать подарок другу" и введи его уникальный 6-ти значный код.
<b>Не знаешь код? Тогда скорее спроси его у друга!</b>
🔰 Тебе откроется информация о друге и его список свободных желаний.
🔰 Выбери понравившийся подарок с помощью кнопки "Выбрать подарок".
🔰 Ты увидишь весь список подарков, которые ты выбрал у своих друзей. Рядом с каждым подарком будет кнопка "Отменить выбор".
🔰 Теперь не забудь купить выбранный подарок к празднику друга ведь он будет очень его ждать!
<b>Для каждого своего друга ты можешь выбрать не больше 2 подарков. Остальные оставь другим.</b>

<i>В случае ошибок и по всем вопросам/предложениям ты можешь написать моему создателю:</i>
https://t.me/dena_den
'''

# description
'''
Я бот 🤖, исполняющий желания! 🔮 (ну почти)
Скоро праздник? Я помогу подсказать твоим друзьям, что ты действительно хочешь в подарок!

🔰 С моей помощью ты можешь составить список своих желаний 📝, а потом поделиться им с друзьями
🔰 Они смогут выбрать понравившиеся подарки и подарить тебе именно то, что ты хочешь 🔥
🔰 Каждый подарок может быть забронирован только одним другом, так что никто точно не подарит одинаковые 👍
'''